tap 'homebrew/bundle'
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'

# Basics
brew 'git'
brew 'diff-so-fancy'
brew 'wget'
brew 'curl'
brew 'sox'          # used in noise command
brew 'mps-youtube'  # used in focus command
brew 'shpotify'
brew 'prettyping'
brew 'bat'
brew 'tldr'
brew 'trash'
brew 'openssl'
brew 'z'
brew 'fzf'
brew 'starship'
brew 'watson'
brew 'pwgen'
brew 'exa'

# Database
brew 'sqlite'
brew 'mariadb'

# node
brew 'node'

# PHP
brew 'php'
brew 'composer'
brew 'imagemagick'
brew 'pkg-config'

# Vim
brew 'vim'
brew 'ack'
brew 'coreutils'
brew 'spark'
brew 'the_silver_searcher'

# Cask
cask '1password'
cask 'iterm2'
cask 'google-chrome'
cask 'firefox'
cask 'microsoft-edge'
cask 'macvim'
cask 'visual-studio-code'
cask 'dropbox'
cask 'transmit'
cask 'sequel-ace'
cask 'docker'
cask 'fork'
cask 'spotify'
cask 'tunnelblick'
cask 'vlc'
cask 'caffeine'
cask 'flycut'
cask 'nextcloud'
cask 'glance' # All-in-one Quick Look plugin
cask 'microsoft-teams'

# Fonts
cask 'font-fira-code-nerd-font'
cask 'font-sf-mono-for-powerline'
cask 'font-ibm-plex'

