tap 'homebrew/bundle'

# Basics
brew 'git'
brew 'wget'
brew 'curl'

# Database
brew 'sqlite'
brew 'mariadb'

# nodejs
brew 'node'
brew 'grunt-cli'

# PHP
brew 'php72'
brew 'composer'
brew 'imagemagick'
brew 'pkg-config'

# Vim
brew 'ack'
brew 'coreutils'
brew 'spark'
brew 'the_silver_searcher'

# Cask
cask '1password'
cask 'iterm2'
cask 'google-chrome'
cask 'macvim'
cask 'visual-studio-code'
cask 'dropbox'
cask 'transmit'
cask 'sequel-pro'
cask 'docker'
cask 'rowanj-gitx'
cask 'spotify'
cask 'tunnelblick'
cask 'vlc'
cask 'caffeine'
cask 'flycut'
