tap 'homebrew/bundle'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'

# Basics
brew 'git'
brew 'wget'
brew 'curl'
brew 'sox'          # used in noise command
brew 'mps-youtube'  # used in focus command
brew 'shpotify'
brew 'prettyping'
brew 'bat'
brew 'tldr'
brew 'trash'
brew 'openssl'
brew 'z'
brew 'fzf'
brew 'starship'

# Database
brew 'sqlite'
brew 'mariadb'

# nodejs
brew 'node'

# PHP
brew 'php'
brew 'composer'
brew 'imagemagick'
brew 'pkg-config'

# Vim
brew 'vim'
brew 'ack'
brew 'coreutils'
brew 'spark'
brew 'the_silver_searcher'

# Cask
cask '1password'
cask 'iterm2'
cask 'opera'
cask 'google-chrome'
cask 'firefox'
cask 'brave'
cask 'macvim'
cask 'visual-studio-code'
cask 'dropbox'
cask 'transmit'
cask 'sequel-pro-nightly'
cask 'docker'
cask 'fork'
cask 'spotify'
cask 'tunnelblick'
cask 'vlc'
cask 'caffeine'
cask 'flycut'
cask 'tomighty'
cask 'seashore'
cask 'notable'

# Quicklook plugins 
cask 'qlcolorcode' # syntax highlighting in preview
cask 'qlstephen'  # preview plaintext files without extension
cask 'qlmarkdown'  # preview markdown files
cask 'quicklook-json'  # preview json files
cask 'quicklook-csv'  # preview csvs

# Fonts
cask 'font-meslo-for-powerline'
cask 'font-anonymous-pro'
cask 'font-ibm-plex'
